md_28= ["Гудеев", "Иванов", "Рисов", "Меженёва", " Ренёв", "Керган", "Полозова", "Сосна", " Женевьёва", "Рыков" ]
md_17 = ["Смирнов", "Иванченко", "Кузнецов", "Попов", "Васильев", "Сидорова", "Новикова", "Соколова", "Юсупов", "Романов"]
sport_grup = tuple(md_28[1:6] + md_17[4:9])
print(md_28)
print(md_17)
print(sport_grup)
print(f"длина: {sport_grup}")
print(sorted(sport_grup))
if "Иванов" in sport_grup:
    r = sport_grup.count("Иванов")
    print(f"Иванов есть и встречается {r} раз")
else:
    print("Иванова нет")